<a href="https://colab.research.google.com/github/rlfwo93/machine-learning/blob/master/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **(Pandas) 판다스란 ?**
-  Pandas는 python 파이썬 외부 공학용 라이브러리

-  andas는 파이썬에서 사용하는 데이터분석 라이브러리로, 행과 열로 이루어진 데이터 객체를 만들어 다룰 수 있게 되며 보다 안정적으로 대용량의 데이터들을 처리하는데 매우 편리한 도구

-  데이터를 표 형태의 데이터프레임에 넣어서 쉽게 이용할 수 있게 해주는데, 쉽게 말해서 파이썬의 엑셀

In [59]:
import pandas as pd #판다스 모듈
import numpy as np  # 넘파이 모듈
import matplotlib.pyplot as plt #플롯립 모듈
%matplotlib inline

# **Series**
-  1차원 데이터 
-  엑셀형식으로 왼쪽에는 인덱스숫자가 나오고 오른쪽엔 입력한 값이 나옴.
-  1차원 배열로 데이터를 담고있음.

In [42]:
s = pd.Series([1,3,5,np.random.randn(1),6,8],index=["a","b","c","d","e","f"] )
s
# 엑셀형식으로 왼쪽에는 인덱스숫자가 나오고 오른쪽엔 입력한 값이 나옴.
#Series에 값을 넣을땐 배열 형식으로 넣음.
# 입력하는값에 float형이 하나라도 있으면 값 전체를 float형으로 출력.
#인덱스 항목을 넣어서 인덱스를 설정 할 수 있음.

a                       1
b                       3
c                       5
d    [-1.008100021338818]
e                       6
f                       8
dtype: object

In [ ]:
s

In [44]:
obj = pd.Series([4, 7, -5, 3])
obj.name = "Pratice" # obj의 이름을 설정,
obj.index.name = "number" # 인덱스의 제목
obj

#입력값이 전부 int형이기때문에 모든값이 int형로 출력되며 데이터 타입이 int

number
0    4
1    7
2   -5
3    3
Name: Pratice, dtype: int64

# date_range 
-  시계열 데이터 설정
-  freq 값을 s,d,m 등을 넣어서 원하는 시간데이터를 출력할 수 있음.

In [60]:
dates = pd.date_range("20201115",periods=4,freq ="d") 
#periods 는 몇개의 값을 출력할지 설정.
#입력한 값부터 perods로 설정한 값만큼 날짜가 증가하여 출력.
#freq가 디폴트 값으로 D로 설정되어서 일별로 증가하여 출력됨.
dates

DatetimeIndex(['2020-11-15', '2020-11-16', '2020-11-17', '2020-11-18'], dtype='datetime64[ns]', freq='D')

In [ ]:
dates1 = pd.date_range(start = "20190101", end = "20190201")
dates1
#start값과 end 값을 주어서 명시적으로 출력.

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08',
               '2019-01-09', '2019-01-10', '2019-01-11', '2019-01-12',
               '2019-01-13', '2019-01-14', '2019-01-15', '2019-01-16',
               '2019-01-17', '2019-01-18', '2019-01-19', '2019-01-20',
               '2019-01-21', '2019-01-22', '2019-01-23', '2019-01-24',
               '2019-01-25', '2019-01-26', '2019-01-27', '2019-01-28',
               '2019-01-29', '2019-01-30', '2019-01-31', '2019-02-01'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
dates2 = pd.date_range("20190101",periods=10,freq="s")
dates2
# freq값을 s로 입력하여 초단위로 출력

DatetimeIndex(['2019-01-01 00:00:00', '2019-01-01 00:00:01',
               '2019-01-01 00:00:02', '2019-01-01 00:00:03',
               '2019-01-01 00:00:04', '2019-01-01 00:00:05',
               '2019-01-01 00:00:06', '2019-01-01 00:00:07',
               '2019-01-01 00:00:08', '2019-01-01 00:00:09'],
              dtype='datetime64[ns]', freq='S')


# **데이터프레임 (DataFrame)**
-  2차원 데이터
-  다차원 데이터 
-  2차원 행렬 데이터를 담고 있음.

In [61]:
df = pd.DataFrame([(4,9,3,1),(5,2,3,7),(3,6,4,1),(1,5,4,3)],index =dates, columns= ("a","b","c","d"))
df

#맨첫번째 입력한 값은 실제출력되는 값.
#index 인덱스 값을 설정.
# columns는 위에 항목의 값을 설정.

            a  b  c  d
2020-11-15  4  9  3  1
2020-11-16  5  2  3  7
2020-11-17  3  6  4  1
2020-11-18  1  5  4  3

In [ ]:
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3]*4, dtype='int32'),
                    'E': pd.Categorical(['test', 'train', 'test', 'train']),
                    'F': 'foo'},
                    index=("a","b","c","d"))
df2

     A          B   C  D      E    F
a  1.0 2013-01-02 NaN  3   test  foo
b  1.0 2013-01-02 NaN  3  train  foo
c  1.0 2013-01-02 NaN  3   test  foo
d  1.0 2013-01-02 NaN  3  train  foo

In [ ]:
dic =  {'A': 1,
        'B': pd.date_range('20130102',periods=4 ),
        'C': pd.Series(1, index=list(range(4)), dtype='float32'),
        'D': np.array([3]*4, dtype='int32'),
        'E': pd.Categorical(['test', 'train', 'test', 'train']),
        'F': 'foo'}

pda = pd.DataFrame(dic,index = ("a","b","c","d"))
pda

   A          B   C  D      E    F
a  1 2013-01-02 NaN  3   test  foo
b  1 2013-01-03 NaN  3  train  foo
c  1 2013-01-04 NaN  3   test  foo
d  1 2013-01-05 NaN  3  train  foo

# **[2] Handling data**

-   head() : 맨처음부터 인덱스 값을 보여줌
-   tail() : 뒤에서부터 인덱스 값을 보여줌
-   describe() : 데이터의 통계적 평균을 보여줌 
-   df.columns : columns 값을 보여줌

In [ ]:
df = pd.DataFrame([(4,9,3,1),(5,2,3,7),(3,6,4,1),(1,5,4,3)],index =dates, columns= ("a","b","c","d"))
df

            a  b  c  d
2020-11-15  4  9  3  1
2020-11-16  5  2  3  7
2020-11-17  3  6  4  1
2020-11-18  1  5  4  3

In [ ]:
df.head(3) #헤드는 데이터프레임중에서 원하는 인덱스값만큼 출력.
#디폴트값은 5

                   a         b         c         d
2020-11-15 -2.417591  1.922836 -0.411459 -1.179493
2020-11-16  0.240926  0.277477 -0.595122  0.434107
2020-11-17 -0.320556 -1.120485  0.809318 -0.830291

In [ ]:
df.tail(3) # 테일은 파이썬인덱싱 -1같이 뒤에서부터 값을 출력
# 디폴트값 5

                   a         b         c         d
2020-11-18  1.101119 -1.187997  0.486765  0.736575
2020-11-19 -0.240250  0.210699 -0.708597 -0.576366
2020-11-20 -1.436088 -0.635727 -1.500996  1.320064

In [ ]:
df.index #df인덱스값을 보여줌.

DatetimeIndex(['2020-11-15', '2020-11-16', '2020-11-17', '2020-11-18',
               '2020-11-19', '2020-11-20'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
df.describe #데이터에 대한 통계적 요약

<bound method NDFrame.describe of                    a         b         c         d
2020-11-15 -2.417591  1.922836 -0.411459 -1.179493
2020-11-16  0.240926  0.277477 -0.595122  0.434107
2020-11-17 -0.320556 -1.120485  0.809318 -0.830291
2020-11-18  1.101119 -1.187997  0.486765  0.736575
2020-11-19 -0.240250  0.210699 -0.708597 -0.576366
2020-11-20 -1.436088 -0.635727 -1.500996  1.320064>

In [ ]:
df.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

# **Sorting(정렬)**

Sort by index : index를 기준으로 정렬

-  sort_index(axis=0, ascending=False)
-  sort_index(axis=1, ascending=False)

In [ ]:
df

NameError: ignored

In [ ]:
df.sort_index(axis=0, ascending=False)
#sort_index는 인덱스를 기준으로 값들을 정렬 
# axis는 columns 값들을 정령할지 안할지 결정.
# ascending 는 내림차순,오름차순 결정 
# False 는 내림차순 True 는 오름차순

            a  b  c  d
2020-11-18  1  5  4  3
2020-11-17  3  6  4  1
2020-11-16  5  2  3  7
2020-11-15  0  0  3  1


Sort by value : column 값을 기준으로 정렬

-  sort_values(by='column')

In [ ]:
df.sort_values(by="b")
#b를 기준으로 값을 정렬

In [ ]:
df.sort_values(by=["a","b"])
#두개의 column을 넣어도 정렬을 하나, a를 기준으로 잡고 정렬을하기때문에 b값은 제대로 정렬인 안될 수 있음.

# **Selecting data by indexing and slicing**

- indexing
- slicing

In [ ]:
df['a']
#인덱스와, column a 의 값을 출력

In [ ]:
df[0:3]
#앞에 3개의 열만 출력

In [ ]:
df['20201115':'20201118']
#인덱스의 값으로 값을 출력

# **Selecting data by label**
- loc : 데이터의 레이블을 기반으로 인덱싱
- iloc : 위치 정수를 기반으로 인덱싱.

In [ ]:
df.loc["20201115"]  
#해당 인덱스 의 값을 다 가지고옴.

a    4
b    9
c    3
d    1
Name: 2020-11-15 00:00:00, dtype: int64

In [ ]:
df.loc["20201115":"20201117",['a','b']]
# 해당인덱스의 column값도 지정하서 값을 출력

            a  b
2020-11-15  4  9
2020-11-16  5  2
2020-11-17  3  6

# **Select data for first two days AND comumn 3,4 from df.**

In [ ]:
df.loc["20201115":"20201116",["c","d"]]

            c  d
2020-11-15  3  1
2020-11-16  3  7

In [ ]:
df.iloc[3] #세번째 인덱스 값을 출력함.

a    1
b    5
c    4
d    3
Name: 2020-11-18 00:00:00, dtype: int64

In [ ]:
df.iloc[0:2,2:4]

            c  d
2020-11-15  3  1
2020-11-16  3  7

불린으로 인덱싱

In [ ]:
df[df.a>1]
# a의 요소중에서 1이랑같거나 작은 인덱스를 제외하고 출력

            a  b  c  d
2020-11-15  4  9  3  1
2020-11-16  5  2  3  7
2020-11-17  3  6  4  1

In [ ]:
df[df>1]
#df중에서 1보다 작거나 같은값을 아예 제외시키고 출력.

              a  b  c    d
2020-11-15  4.0  9  3  NaN
2020-11-16  5.0  2  3  7.0
2020-11-17  3.0  6  4  NaN
2020-11-18  NaN  5  4  3.0


# **데이터 재구성(setting) 또는 확장**


Setting data by label

- at  : 레이블 기반으로 하나의 값에 접근
- iat : 위치 기반으로 하나의 값에 접근.

In [ ]:
# 예시 df

pdf = pd.DataFrame ({
    'a' : list(range(4)),
    'b' : list(range(5,9)),
    "c" : np.arange(10,14)},
    index = ("one","two","three","four"))
pdf

       a  b   c
one    0  5  10
two    1  6  11
three  2  7  12
four   3  8  13

In [ ]:
pdf.at["one","b"] # "one" 인덱스에 "b "콜룸은 5

5

In [ ]:
 # at함수를 이용하여 값 변경
pdf.at["one","b"] = 100
pdf

       a    b   c
one    0  100  10
two    1    6  11
three  2    7  12
four   3    8  13

In [ ]:
pdf.iat[0,2] # 0, 2 에 있는 값은 10

10

***Data 추가 , 수정하기***

In [ ]:
# loc 을 이용하여 새로운 콜롬 df 을 만들고 값을 세팅.
pdf.loc[:,'d'] = np.array([5] * len(pdf))
pdf

       a    b    c  d
one    0  100  100  5
two    1    6   11  5
three  2    7   12  5
four   3    8   13  5

In [ ]:
#column e항목을 추가하고 값을 넣음.
pdf["e"] = list(range(4))
pdf

       a    b    c  d  e    f
one    0  100  100  5  0  100
two    1    6   11  5  1    7
three  2    7   12  5  2    9
four   3    8   13  5  3   11

In [ ]:
# f항목을 만들고 a,b 값을 더한 값을 넣음.
pdf["f"] = pdf["a"]+pdf["b"] 
pdf

       a    b    c  d  e    f
one    0  100  100  5  0  100
two    1    6   11  5  1    7
three  2    7   12  5  2    9
four   3    8   13  5  3   11
five   3    5    4  3  2    8

In [ ]:
#loc 을 이용하여 인덱스를 추가하고 값을 넣음 .
pdf.loc["five"] = [3,5,4,3,2,1]
pdf

       a    b    c  d  e    f
one    0  100  100  5  0  100
two    1    6   11  5  1    7
three  2    7   12  5  2    9
four   3    8   13  5  3   11
five   3    5    4  3  2    1

In [ ]:
pdf.at["one","FFg" ] =  list(range(4))
# at, iat는 한 값에만 접근 할수 있기때문에 전체를 셋팅하거나 변경하려고하면 에러가 남 .

ValueError: ignored

# ***데이터프레임 인덱스,column 삭제하기***

-   drop() 함수사용

In [7]:
#예시 df

prdf = pd.DataFrame({
    'a' : list(range(4)),
    'b' : 1,
    'c' : list(range(3,7)),
    "d" : 0},
    index = ("one","two","three","fowr")
)
prdf

       a  b  c  d
one    0  1  3  0
two    1  1  4  0
three  2  1  5  0
fowr   3  1  6  0

***columns삭제하기***

In [8]:
# 방법 1
prdf.drop(["a","b"],axis ="columns")
# default로 axis = 0 이며 1을 넣거나, axis = "columns" 을 하면 콜룸 값 삭제.

       c  d
one    3  0
two    4  0
three  5  0
fowr   6  0

In [9]:
# 방법 2
prdf.drop(["a","b"],axis = 1)

       c  d
one    3  0
two    4  0
three  5  0
fowr   6  0

***index삭제하기***

In [10]:
#방법 1
prdf.drop(["one","two"])
# axis의 default 값이 0이기 때문에.

       a  b  c  d
three  2  1  5  0
fowr   3  1  6  0

In [11]:
#방법 2 
prdf.drop(["one","two"], axis = "index")
#axis에 index를 적어도 가능.

       a  b  c  d
three  2  1  5  0
fowr   3  1  6  0

***index가 DatetimeIndex 일때 삭제하기 .***

In [12]:
#예시 DF

prdf1 = pd.DataFrame( pd.DataFrame([(4,9,3,1),(5,2,3,7),(3,6,4,1),(1,5,4,3)],index =dates, columns= ("a","b","c","d")))
prdf1

            a  b  c  d
2020-11-15  4  9  3  1
2020-11-16  5  2  3  7
2020-11-17  3  6  4  1
2020-11-18  1  5  4  3

In [13]:
prdf1.drop(dates[0:2], axis = "index")
#index에 사용된 dates를 불러와서 인덱싱방법으로 인덱스를 삭제해야함.

            a  b  c  d
2020-11-17  3  6  4  1
2020-11-18  1  5  4  3

# 중복값 확인하기
-  df.duplicated함수 사용하여 중복값 확인

In [ ]:
# 예시 df

du = pd.DataFrame(columns=['id', 'desc'])

du.loc[0] = ["sbs", "aaa"]
du.loc[1] = ["kbs", "bbb"]
du.loc[2] = ["mbc", "bbb"]
du.loc[3] = ["ebs", "ccc"]
du.loc[4] = ["kbs", "eee"]

du

    id desc
0  sbs  aaa
1  kbs  bbb
2  mbc  bbb
3  ebs  ccc
4  kbs  eee

In [ ]:
#맨처음 값은 비교할 columns 를 넣음.
#keep = 에는 "first" , "last", False 가 들어감 
# "first" = 중복된 맨처음값을 뺀 중복된값을 Ture로 리턴
print("keep ='first': {0}  \n".format(du.duplicated(["id"],keep = "first")))

# "last" =  중복된 나머지 값을 뺀 중복된값을 True로 리턴
print("keep = 'last': {0}  \n".format(du.duplicated(["id"],keep = "last")))


# False =  중복된 모든 값을 True로 리턴 
print("keep = Flase : {0}  \n".format(du.duplicated(["id"],keep = False)))

keep ='first': 0    False
1    False
2    False
3    False
4     True
dtype: bool

keep = 'last': 0    False
1     True
2    False
3    False
4    False
dtype: bool

keep = Flase : 0    False
1     True
2    False
3    False
4     True
dtype: bool

# **중복값 제거하기**
-  drop_duplicates() 함수 사용하여 중복값 제거

In [ ]:
du

    id desc
0  sbs  aaa
1  kbs  bbb
2  mbc  bbb
3  ebs  ccc
4  kbs  eee

In [ ]:
du.drop_duplicates(["id"],keep = False)
#keep 값을 False로 주면서 id에 있는 중복된 값을 전부 삭제

    id desc
0  sbs  aaa
2  mbc  bbb
3  ebs  ccc

In [ ]:
du.drop_duplicates(["id"], keep = "first")
# keep 에 "first"를 넣으면서 id에 있는 중복된 처음값을 제외하고 삭제.

    id desc
0  sbs  aaa
1  kbs  bbb
2  mbc  bbb
3  ebs  ccc

In [ ]:
du.drop_duplicates(["id"], keep = "last")
# keep 에 "last"를 넣으면서 id에 있는 중복된 마지막값을 제외하고 삭제.

    id desc
0  sbs  aaa
2  mbc  bbb
3  ebs  ccc
4  kbs  eee

# **Missing data 확인하기**
 Missing data(결측값) : 누락된값, 비어있는 값, NULL Data를 의미.  실제 데이터 수집과정에서 발생한 오류 등으로 인해 결측치가 포함되어 있는 경우가 많음.
 결측값을 발견,확인하고 이를 삭제,수정하는 작업은 매우중요함.
- isnull() : 관측치가 결측이면 True 결측이아니면 Fasle를 반환.
- notnull() : isnull()과 반대  결측값이면 False 아니면 True 를 반환

***Missing data(결측값) 확인하기***

-  isnull() : 관측치가 결측이면 True 결측이아니면 Fasle를 반환.

In [111]:
# 결측치를 가진 df를 만듬 .

md = pd.DataFrame({
    "a" : list(range(4)),
    "b" : list(range(5,9)),
    "c" : np.nan
    })
md

   a  b   c
0  0  5 NaN
1  1  6 NaN
2  2  7 NaN
3  3  8 NaN

In [112]:
md.isnull()
#C는 전부 결측값이기때문에 True반환

       a      b     c
0  False  False  True
1  False  False  True
2  False  False  True
3  False  False  True

In [113]:
md.isnull().sum()
#결측값의 갯수를 보여줌 .

a    0
b    0
c    4
dtype: int64

In [115]:
md.isnull().sum(1)
# 행 단위로 결측값의 갯수를 보여줌 .

0    1
1    1
2    1
3    1
dtype: int64

In [116]:
pd.isnull(md)

       a      b     c
0  False  False  True
1  False  False  True
2  False  False  True
3  False  False  True

 - notnull() : isnull()과 반대  결측값이면 False 아니면 True 를 반환

In [117]:
md

   a  b   c
0  0  5 NaN
1  1  6 NaN
2  2  7 NaN
3  3  8 NaN

In [118]:
md.notnull()

      a     b      c
0  True  True  False
1  True  True  False
2  True  True  False
3  True  True  False

In [119]:
md.notnull().sum()
# 결측값이아닌 실측값읙 갯수를 보여줌

a    4
b    4
c    0
dtype: int64

In [25]:
pd.notnull(md)

      a     b      c
0  True  True  False
1  True  True  False
2  True  True  False
3  True  True  False

# **Missing data(결측값) 제거하기**

-  dropna() : column내에 NaN값이 있으면 해당 행을 전부다 삭제함 .
-  dropna(1)  1을넣으면 NaN값이 있는 해당 열을 전부다 삭제함 .
- fillna()  : 결측값을 다른값으로 대체해주는 함수.
- replace() : 결측값을 다른값으로 대체.

In [63]:
# 예시 df
md.iat[0,2] = 2
md

   a  b     c
0  0  5     2
1  1  6  None
2  2  7  None
3  3  8  None

In [68]:
md.dropna()
#값이 있는 모든 행을 삭제함.

   a  b  c
0  0  5  2

In [88]:
md.dropna()
# 결측값이 있는 모든 열을 삭제함

   a  b     c
0  0  5     2
1  1  6  None
2  2  7  None
3  3  8  None

In [97]:
md.dropna(thresh = 3)
# thresh = 3 는  실측값이 3미만인 열을 지운다는 것.

   a  b  c
0  0  5  2

In [98]:
md.dropna( how = "all") 

# how 에는 any와 all 이 들어 갈수 있다.
# all은 한열이나,행이 모두 결측값일때 삭제한다는것.
# any는 결측값이 포함된 열이나,행은다 삭제한다는것,

   a  b     c
0  0  5     2
1  1  6  None
2  2  7  None
3  3  8  None

In [99]:
md.dropna(how = "any")
# 결측값이 포함된 모든행이 삭제됨.

   a  b  c
0  0  5  2

***fillna() 함수 사용***

In [102]:
# 예시 df
md

   a  b     c
0  0  5     2
1  1  6  None
2  2  7  None
3  3  8  None

In [101]:
md.fillna(5)
# 결측값을 전부 5로 대체.

   a  b  c
0  0  5  2
1  1  6  5
2  2  7  5
3  3  8  5

In [104]:
md.fillna(method = "ffill") 
# 결측값 앞에 있는 값을 가져옴 .

   a  b  c
0  0  5  2
1  1  6  2
2  2  7  2
3  3  8  2

***replace() 사용하기***

In [120]:
md

   a  b   c
0  0  5 NaN
1  1  6 NaN
2  2  7 NaN
3  3  8 NaN

In [122]:
md.replace(to_replace=np.nan ,value = 50)

#결측값을 50으로 대체.

   a  b     c
0  0  5  50.0
1  1  6  50.0
2  2  7  50.0
3  3  8  50.0

# **데이터 통계 (Statistics)**

-  mean() : default 값은 열이고, 평균을 구해줌.
-  sum() : default 값은 열이고, 값을 다 더해줌 .
-  max() : 가장 큰 값을 반환  .
- min() : 가장 작은 값을 반환 .

***- mean() 사용하기***

In [126]:
df

            a  b  c  d
2020-11-15  4  9  3  1
2020-11-16  5  2  3  7
2020-11-17  3  6  4  1
2020-11-18  1  5  4  3

In [131]:
df.mean() 
# 각 columns의 평균을 구해줌 .

a    3.25
b    5.50
c    3.50
d    3.00
dtype: float64

In [132]:
df.mean(1)
# 각 인덱스의 평균을 구해줌,

2020-11-15    4.25
2020-11-16    4.25
2020-11-17    3.50
2020-11-18    3.25
Freq: D, dtype: float64

-  ***sum() 사용하기***

In [134]:
df.sum()
#각 열들 다 더해줌.

a    13
b    22
c    14
d    12
dtype: int64

In [135]:
df.sum(1)
# 각 인덱스를 다 더해줌.

2020-11-15    17
2020-11-16    17
2020-11-17    14
2020-11-18    13
Freq: D, dtype: int64

***-  max(),min()사용하기***

In [143]:
df

            a  b  c  d
2020-11-15  4  9  3  1
2020-11-16  5  2  3  7
2020-11-17  3  6  4  1
2020-11-18  1  5  4  3

In [141]:
print("df.max()= {0}".format(df.max()), end = "\n\n")
print("df.max(1)= {0}".format(df.max(1)))

df.max()= a    5
b    9
c    4
d    7
dtype: int64

df.max(1)= 2020-11-15    9
2020-11-16    7
2020-11-17    6
2020-11-18    5
Freq: D, dtype: int64

In [142]:
print("df.min()= {0}".format(df.min()), end = "\n\n")
print("df.min(1)= {0}".format(df.min(1)))

df.min()= a    1
b    2
c    3
d    1
dtype: int64

df.min(1)= 2020-11-15    1
2020-11-16    2
2020-11-17    1
2020-11-18    1
Freq: D, dtype: int64